[
  {
    "title": "fps6",
    "tags": [ "C++", "OpenGL" ],
    "images": [ "fps6_1.png", "fps6_2.png", "fps6_3.png", "fps6_4.png", "fps6_5.png" ],
    "content": {
      "en": "This is a game which is based on the <a href=\"http://web.archive.org/web/20150630205952/http://sandbox.yoyogames.com/make/tutorials\" target=\"_blank\">fps tutorial from GameMaker</a>, which is basically a Wolfenstein 3D clone with a single level. This version however was extended by cheats, mouse support, music and an indicator of when you have actually finished the level. In addition to the gameplay improvements, a random level mode was added, where new levels are generated on the fly.",
      "de": "Dies ist ein Spiel, das auf dem <a href=\"http://web.archive.org/web/20150630205952/http://sandbox.yoyogames.com/make/tutorials\" target=\"_blank\">fps-Tutorial von GameMaker</a> basiert, das im Grunde ein Wolfenstein 3D-Klon mit einem einzigen Level ist. Diese Version wurde jedoch um Cheats, Mausunterstützung, Musik und eine Anzeige, wann man das Level tatsächlich beendet hat, erweitert. Zusätzlich zu den Gameplay-Verbesserungen wurde ein Zufallslevel-Modus hinzugefügt, bei dem neue Levels in Echtzeit generiert werden."
    },
    "buttons": [
      {
        "title": {
          "en": "Play in Browser",
          "de": "Im Browser spielen"
        },
        "url": "/demo/fps6"
      },
      {
        "title": {
          "en": "View Code",
          "de": "Code durchstöbern"
        },
        "url": "https://github.com/falki147/fps6"
      }
    ]
  },
  {
    "title": "GMLAST",
    "tags": [ "C++", "Syntaxanalysis" ],
    "content": {
      "en": "GMLAST is a library that performs lexical analysis and parsing of the <a href=\"https://en.wikipedia.org/wiki/GameMaker#GameMaker_Language\" target=\"_blank\">Game Maker Language (GML)</a>. Its primary function is to transform GML code into an <a href=\"https://en.wikipedia.org/wiki/Abstract_syntax_tree\" target=\"_blank\">abstract syntax tree (AST)</a> that can be utilized for further processing. Additionally, it is capable of identifying errors in the code.",
      "de": "GMLAST ist ein Parser und Lexer für <a href=\"https://en.wikipedia.org/wiki/GameMaker#GameMaker_Language\" target=\"_blank\">Game Maker Language (GML)</a>. Die Biliothek nimmt Text und wandelt ihn in einen <a href=\"https://en.wikipedia.org/wiki/Abstract_syntax_tree\" target=\"_blank\">abstrakten Syntaxbaum (AST)</a> für die weitere Verarbeitung um. Sie kann auch zur Fehlererkennung verwendet werden."
    },
    "buttons": [
      {
        "title": {
          "en": "Try the demo",
          "de": "Demo probieren"
        },
        "url": "/demo/GMLAST"
      },
      {
        "title": {
          "en": "View Code",
          "de": "Code durchstöbern"
        },
        "url": "https://github.com/falki147/GMLAST"
      }
    ]
  },
  {
    "title": "Analytics as a Service (Frontend)",
    "tags": [ "Angular", "TypeScript" ],
    "images": [ "AaaS_1.png", "AaaS_2.png", "AaaS_3.png", "AaaS_4.png", "AaaS_5.png" ],
    "content": {
      "en": "AaaS, which stands for \"Analytics as a Service\", is a service that is designed to collect data and log messages from various applications. It was originally created for the SWK5 and WEA5 courses. The provided demo and its source code only covers the frontend component.",
      "de": "\"Analytics as a Service\", oder AaaS, ist ein Dienst, der Daten und Protokollnachrichten aus verschiedenen Anwendungen sammelt. Er wurde ursprünglich für den SWK5 und den WEA5-Kurs entwickelt. Die bereitgestellte Demo und deren Quellcode umfassen nur die Frontend-Komponente."
    },
    "buttons": [
      {
        "title": {
          "en": "Try the demo",
          "de": "Demo probieren"
        },
        "url": "/demo/analytics-as-a-service"
      },
      {
        "title": {
          "en": "View Code",
          "de": "Code durchstöbern"
        },
        "url": "https://github.com/falki147/wea5"
      }
    ]
  },
  {
    "title": "MikePay",
    "tags": [ "JavaScript" ],
    "images": [ "MikePay_1.png", "MikePay_2.png", "MikePay_3.png", "MikePay_4.png", "MikePay_5.png" ],
    "content": {
      "en": "This is a project designed to make it easier for people to order food collectively. Users can add their desired items to an online order, which the administrator will pay for, and then the users can reimburse the administrator later. This project was created specifically for the WDP3 course.",
      "de": "Dieses Projekt erleichtert Sammelbestellungen bei Lieferdiensten. Jeder Nutzer kann seinen bevorzugten Artikel zu einer Online-Bestellung hinzufügen. Der Administrator bezahlt die Bestellung und der Nutzer kann später bezahlen. Es wurde für den WDP3-Kurs entwickelt."
    },
    "buttons": [
      {
        "title": {
          "en": "Try the demo",
          "de": "Demo probieren"
        },
        "url": "/demo/mike-pay"
      },
      {
        "title": {
          "en": "View Code",
          "de": "Code durchstöbern"
        },
        "url": "https://github.com/falki147/MikePay"
      }
    ]
  },
  {
    "title": "MVVWB",
    "tags": [ "WordPress", "PHP", "CSS", "JavaScript" ],
    "images": [ "mvvwb_1.png", "mvvwb_2.png", "mvvwb_3.png", "mvvwb_4.png", "mvvwb_5.png" ],
    "content": {
      "en": "I'm the administrator of <a href=\"https://www.mvvwb.at/\" target=\"_blank\">www.mvvwb.at</a>, the website of our local wind band. The site is built with WordPress. It uses a custom template and custom plugins.",
      "de": "Ich bin der Administrator von <a href=\"https://www.mvvwb.at/\" target=\"_blank\">www.mvvwb.at</a>, der Website unseres örtlichen Musikvereins. Die Seite ist mit WordPress erstellt. Sie verwendet ein eigenes Design und eigene Plugins."
    },
    "buttons": [
      {
        "title": {
          "en": "Visit mvvwb.at",
          "de": "mvvwb.at besuchen"
        },
        "url": "https://mvvwb.at/"
      },
      {
        "title": {
          "en": "View Code",
          "de": "Code durchstöbern"
        },
        "url": "https://github.com/falki147/mvvwb"
      }
    ]
  },
  {
    "title": "Boxes 'n' Platforms",
    "tags": [ "C#", "OpenGL" ],
    "images": [ "bnb_1.png", "bnb_2.png", "bnb_3.png", "bnb_4.png", "bnb_5.png" ],
    "content": {
      "en": "In this third-person 3D platformer game, the objective is to collect as many diamonds as possible while reaching the end. However, be cautious of dangerous obstacles such as spikes and enemies that you must avoid along the way. The game consists of four different levels to play through. Developed in 2016 as a school project, this game was written in C# using SDL2, OpenGL, and the Bullet physics engine.",
      "de": "In diesem Third-Person-3D-Platformer ist es das Ziel, so viele Diamanten wie möglich zu sammeln und das Ziel zu erreichen. Achte jedoch auf gefährliche Hindernisse wie Stacheln und Feinde, die du auf dem Weg abwenden musst. Das Spiel besteht aus vier verschiedenen Levels, die du durchspielen kannst. Dieses Spiel wurde 2016 als Schulprojekt entwickelt und in C# mit Hilfe von SDL2, OpenGL und der Bullet-Physik-Engine geschrieben."
    },
    "buttons": [
      {
        "title": {
          "en": "Download",
          "de": "Herunterladen"
        },
        "url": "https://github.com/falki147/BoxesAndPlatforms/releases/download/v1.1.0/BoxesAndPlatforms.zip"
      },
      {
        "title": {
          "en": "View Code",
          "de": "Code durchstöbern"
        },
        "url": "https://github.com/falki147/BoxesAndPlatforms"
      }
    ]
  }
]
